# -*- coding: utf-8 -*-
# @Time    : 2018/8/24 10:20
# @Author  : zhoujun

# NOTE: -1 is reserved for 'blank' required by mxnet ctc
BLANK_SYMBOL = '_'
no = '0123456789'
no_alphabet = no + BLANK_SYMBOL
num = u'0123456789.-\/:;D,wsCc()zo+v'
num_alphabet = num + BLANK_SYMBOL
txt = '臣击居移鼻炉栀魏展多酚蘑数泥槽野蓝散售占服检含府葵咨德蔓退扫撕岩锂浅福穹蜡吸茯碍旭迪泛般材远猪柏肌止热活搔鑫芷湿耗锆荫稚盏赢梭抑听朋把取癃丝耀丸比厚利冻及衰晋弓怀育支華宽氦健蔡差袖科息济谊钢呼苷窿萤凝染凌结就扩扶分后凇联十础煎贵反巷糪时榆翻资桐起麸常言变大制隙能羟冠蒡气赖蔘张找肺百便恺冷锌衍专援景广三珊祥磨簧馆岛赫娃突薢贝熟值稣眠佳嫩仙晒酵淋甘拔袭于延霜埃响黑疣榈麒蚀茵轮齦翁水乳鳞转盆勃劈搏键泵毕枇斜寝葛职芃告各雪械长哈珂微庤教柯备癖每领聚因残维醯薯七趾绕总豪草园唐陈绷澳阀给液诱禾谱祛芬拜良壮愈诃医缬约涵短铬国戟叁心绿琼路际肯沃玛振孚销奈续民叫方癜拕产翠奠天龙应湘邮镑轩贰咀皂策痰涎链令沉痣喉冀造掩身杭最劲坤儿疚篮烧伟黏激汀境筝彤盒性怪復菲何辐婷鸡氏低癥芐瘤烯他楂葫桉潘易沥尼狂声糖兰萨轴稳尘锦过屋璃呋嘧妮塞瞳板檗泸森滩肾鲤檬斛庄颧廊捷语畸杏氯损膀陇浜超债爆榭系克塑逆扁室蒽环余飞忍谢桥党溪运作腰禅义翼托率胚缀唯杉可植粪庭泊手毒呕鼓碘孟鱼探险速几睡肥标紫烟醇袪渴丰引夏属浓脒饮鹏疡抢惨上庆穿熏崇蜕双妆哮另依向压嗦子海盖准瓣户蛇俭妈规希珈外酰滴力列疾业痹胖里殊弯交巨柿钉癣吲豉母醚闽晕诊萘喳捌曼铜舒恩浮论梢雯农期赛附汁镫迷股脉窥啶次蒿唇但状煨浦匀霰杜寻源柄贴泉商流搽原辰脏扬蛸导虫默疫兽模毛酞脾称珠与麝赝枝耵万茱博厄茂额瘰置风辛京杷文务久整央飘郭布重合伐茄块图关虾请朱任唥润坳都髋蜂奶蔷受厦众颔踝窝亥颐记恶月膏醋泳果贤庙叉层深配膝盈树馥抜锡瘘滋袋士异付吹幽泰急花赵核妇甜只询理南舌胀藻镍高噻锐辽鲜郁脲沐侬究马苓翳团紧芳清彩格哚圳硝犬查消栗氟耐孔促焙群咣黄鳄害戊栾嫬蛋呢并房被蒜尚硫出照木牛摘嗉蛰亚癸钻量容美聍弎添凡营遵观铵固物点枸垂船江猴已萸椒咗腮龄屈疼想葡湖刷酸旁奉嚏仲友芡叔呱喜秋丹枙帕杰螵洁幼敌颌试填泮刺欣阳灭肽藿光梗如带连敏蝶汞络拗莪妙苏雾释谜元补荞浆絮充租酯啉摄坑所秀莱迫胯磺荡佛杂夷苠淫拨钾还箴秘牌势渡东炔网留阁盘燥汗参桔素介虎首茛进闵菟药葆沛姓苍饱蕊种籓练待枳预满睛钆调苄员病淳蓣经委石盐埔氛晨眉早视四榴橡故墴凯难撞瑞褶沿基痘棘褐六亿羔之尾税腻芎密藤麦癓脯才伦授裸咖例疹全铁稹普抛疏杨师油融杀好泡灰冡纳未态疳赤峰垫霍玫酱甙测使瘠需淤枯社干纶索正寒惹栓鸟苡暂竣伍映卷断罕琳滤鲁烙缘疮泪按帽粒肆丁五复肪狻假睦颗乱墨蹬宙洽莨闸票望法则型晴垸菜乙逍左典护鲨吁皿王至杞停站米拓体罩诺夹喘的生季示事近担舟邱柳军随芩尤捈狗改卫载着娠湾西老腔胎摩浸琅穗窦壁崔秦皋火第提磷州糜芥市然特区条吨枣华缓黎祁钞羊乃哆暗谷茴稀觉意瓶界蒙混政刻走坦鞣输宫地槐径治冶角邦艽遥佰菌娜囡溶罐纸穴埋街鸿沫莎权择遂镜瓷噫甫趋膦头局腺粉度痛歆爽棉孜疗倩灸技二孢田卜馈云薄顺门替炼髓悉堵施厅它件橼扭积漕恒贞单死漱独钡简色套洗铸质蝎藏直胃谈宣达蔗纱计傲麟年爬录品定者葱抒话必类洞亭汇蟅刚监工橘名端勒汉靶矾边腹肝空芪姜籍镁详烷初裹圣梨渍萝唑蔻笛枫椽烁肮巴精解肟肃射完为劳撩乌升宇份显操棱椎样胶胺阴伸盼蒲氢疱疲涌蟹代归幻迈豆釉纺住楷旱泻枪硅史排甾隔县弃菪炒鹅虹喹硕仰酶帅竟嵩自曹和妥欧酒酐裕顶静齐塘菱脐鉍味传葶蓼眝冒背律感苋负换溴腾耳蛭半菇恬肢挫宏荧钛吊缝情阈忻犀昆启征俞伤龈问翘刮梅宁估有跌弱灌浣切店陆胸钯鉴岁尔念富限再钩下软成蔽眼荆疑去选彬研瘫防暖拆通呤做昔片根效刀嘌不芦等院岑公筛极床酣麻粘式松桩墩缴滑游柴嗪咬萎痤土历部来莘周或纈间膨骨芯针学具接甁芽末触注屏污萍绒锁镉臂尪官集捡蜗破焦玖醌波养形弹逐榕氮楼城山透姆挂九颈丙苹智化财封鹿肩以薇红徐茁承冬侧香家震创咳巧肛训衬乡铍泗败认茅迅离瓦罗薏珺曝喷芙泌盯倍滨除企吝平膜安白旦奇见凤潍赌允腱筋抗淮悦莲威个氧康咪插珀纷粗醛主潜梦综弧乐缺善陀睾序瘟痧翅括烫津卤杵步码村武紊嗜笋会协费温硒益思建放古吖柱伏脊莫锉位喃共萦灯强舜金竹错杆钴葩签蠲毫疬净臭折扑同春球非评铂呲价柒棒青致搐壳追仁买功也钼右包熨腐沟泽用表顾太棋恳电蓟炎两报畄夫矫内肼航辨血卓实场吗闪砂这先俄少申割钟祺忧锰螨柠加歧千钱河逸旋笨司聖淀沙贺免蕙送肤脱匮颠俊临夭浙嗽惠刘而乔毗蒎蟒肠管露循信羌恢级别兆脂供什囊妊痔辅立台误阶新铅碱抽炙摸剔牙卡佐食桑昌奥象拿桃迎癌辩豫曙尖朵仑助煮蝉阻渊北畅朗硬杯讯钵中号洒真毋港厘症脓舍晶窍须休醒竭批怡证庚洛锋打线机得兵前裂入苁坊樟睑英殷胰厂芍戴樱炭决玻芝凉节小脑保蒸拾推严陪寺牵丽鹤冲蜜仔螺避辣蟾宝洋处从咛在隆尿萆腋口胍帖要淞其啡莵皮痒救糊仪己顿料颉岳匹旨芒泾曲影巯对当志印危慧宾落举擦君扎萄绪灵斯目座冢催据悠银阿绣渗珍蔬堂烤颛羧患装知孕析衡降频剂呀硼快汾统匪襞肉笔叮吐瑟泼塔设构班缩适册术锯嚼伊卵瑚涤佩哌敷铋没世黛桂瓜苗川脈磁奎慈圆玉荷隐胞岐童弥伪伽腿茜熊冰副确底纤棕嵌浴卢瘀浊於修餐嘉相永糠胆滞蓉娘籽蛎无嘴寓段牡祝命雅氨眩雌献划面林苯收婴翔羚蚓衣减咏灶漠雍跟唾坎车癀拉纟醉梓八菊抚回韦盛是行幸琪陷锑肿祭荣开雄碧吡彭席祖纯酪郊挑聆腕艾酊汤纹钙指啊发呐酮拍嗓苦织吉淡星道茶丫沸派琥督丛本斑足傅叶像礼慢扰宜虑程绵亮增诚旧氩诗算剑佑抓夜控考沪窄藓伴明涂描采吴项塌寿器女坏氖甲碳汽障厌字攻齿看蚕內璐兴雁溃那招失人闭验咽音颅霞细悬动霉腥寄胱厉察钳鹰更锻培神荟日渣钠爱抹雷玄壹围洲硷写仟昼簇一铺组胡优镇铝账零宗'
txt_alphabet = txt + BLANK_SYMBOL

all_alphabet = num + txt + BLANK_SYMBOL

zyqd = """宗褪纺斯筹生塘法？疹指瓠疸］航临坛4疚欲桡腋玫念吲妮氯羧瞬插胶曼Ⅰ吋瓷输广太戮尊意司曝宇侧幻舍来敏技噫汉达产到放据萸巯娠怜画鲲次福猜祛兽蔻菠钬创茵攻舟厉阿拜亥读位渊西券社唐素梢娟钆匹拆简内圣圾呼武浦晟年菇置菊※#授钯τ惭蔓文渣枸哆胜窝飞逐蒸锰聚佩绵廉扑虫菱丰县缝谜匣■桶滩丁祖辛泽;字真直观消群接艰曖脓弥宫墨炳=论顺春p囚诵畸功氩疗雌a哪龙对∏售计淤蘭触很菏杆…浊长酵醚肟:辉宰豪嗓嗽主帅作殖啊洎渗容花财流吕棕V深尪周溴认午泳镀抢胃挂淫和命嘧)蕾煨辰滋辐剔互兆杯晰坐起鞋舒滕赞腹友庆滨?允标待C倍圳籓于手丫正浅志壹莨毫萘排辣庶铺钡漆走了制峻嗉别窦派妻支肠拕坤坝说铜酱击瘠箱蠡中洁而淇规珠偿喹→杉醒乘宝船十窿紊鄂渍大灭拉鹤槽葱镇副两万照余瓣钵畅委搜丘赖牡质缬鹊藓癖抵井f越δh居关眩街涤榆隆餐律５显痉d新《胍升酪y罐抒限忻订葭症勋库路邮绍拇▲仝拔䂡纟萌微樟渔至茂烧虹咣探囊浮饱嘟酰尔J杵贺体b劳铵闪束列曲〔出爬疑脾代造剪泵测过２边朋诗独翻炼癜澡丝恩充求你函户缠G识问权附叠﹕慈廊腭箭蛇瑶癸铅阈糜压降术些摘矫姓回猪厕钟编翅瘤栾肺策协膨帐细密截著眝岁脚脉魏端合廓赘间耳渭裹削－膳班银辨呱竣付鲁解赤畄盆暂莲诺Y瞿黏病景巧}逆透皿看１泌眶瘙好馥每疣检萆科佳贻镍斗千栗纵晴仰皋纹溃熙胰熏送m今颅扎搽剑型量本摄偏维茜飘H称艾棒奈~途癣琼妆报瞄罕捡串〕*3毕吻△衍梅烤纠砜芜曹征w苠灶劲剩睡钦肮额硒娩歆净甸孕北鳄敦肉亮苄异涡械毯呐【抑车绿莞急里黑奉渐贴季η蟾谱肪川批矮戊题死毋挑卞铸注三芪伐添酯之啬股心痘蝶铭玻茗番纳展磕贵苗略宠猴溏研％醋炒荫甜汤檗沫永甘雄—商扬 扣缓泸萍橼枯戴仓短６珂他芡艺墙家塌伤垸肃镁免询米Q弗队吁菜柏速：套革寒灵'拘捷坏浪苷姑政包蟒忧幼党刘醛鹅眼匪鸿便哩烙糕静湾赌粪钱以砸勃郭夭吊血背钼予盈议殊获寝1什末钛久胱暖臂咗會费停镐、钠烁评筛甲》变溢网冰琪瘫钙任冀税茶膝蠲壳方內叮师鼻衣决吨辽淡葛脲n椽综宁旱软糪团租苓袪从葫案闻洲双麸昆荟威γ纬舌尤纯琥鞣肥芙院相麦龈嗪炙◆杞仁.扁晓票痛Ｃ沐仑↓阮`锂离震藤青理贝<林么感洫
泊爱禁牛霞酥汾碾瞩栓士泼癞草统更割鼓狼势豚嗯阵拨淮娜森瀚饭剥於通载逸玩资拾桃齦如值萤螂ϒ盼芬馏八珈(邢泣孜rS多写赝查恬瑙极台骶肽般嗅羌角嘌晚南笔挫氦及杏咖脏买氳应东朗寓锥狻浆癃喊未欢只收硅朴忽鮮气珀λ丽君滇歧济燥底为珊莓慨误孚絮屈挽伸υ带泡q号节颔枝犹鼎演眠贸丹悉霖懸瓶⊥葡疳卡晶芩旧超戈庭欧汇氵吸痴类萄莵潮态幕弊撞酣建凵棉存疬高打扫腕桐眉宮胖鞘氧桥情窗妊嵌葵丸蓟伦恒疡蒙窍-砂杀娃扩喉归请婴兜朱专与泾影壶敚厅颇荆阴谢柱裕汞州公该陷蓣享苞婷分奶腿怀省眯钢瓦灌失喘绝潘养固鲨象材Ｂ滴拗e巾考鑫帽萝折下突開您茨山蒿惨磺香况改噬蛸伴厄晨浸告‖漩宋醌浓音央汐辙辅阀漠楼墩尘绕颠鉀种吹左纱扶≥俄咛鼠码装缀妹默败夫汪愤梭爆做③第月痤穗植孵众荡薯板磁煎牵荣声肛浩癓痹骨氏漫乃验钾乎仔菲翔楷o呕详采徐何领沸适根帕帖摞麟几绷申姜宣活腰宿道葆摩堡繁救芒墴O罩卫肱藿铬滥目止啉按刨谊这梗溪叔碘联田茛但业檬场蒜簇男整浣表漱机讯即+睾黄疱柔」致鸽狭蓉韩苍赔郁雁康环韦管壮究乌·螵冫非衬桉復枣百圈迷届酬蓄俞蚓沿度藻莪波就祥槐呆臭蕊肢凉煮电光翘隶访是洛唑钉催u陶爨蝮疲颧傅吖责锯蛎锁蔽裸世綜癥残把界险览盐空润兴萨!龄赵全镰抗避护冬Z共瘟弯肾磨羊巖另裂上易国髋珺溶海围颗庚缅择淳碳猫梦老涎厌F熊精等茎吟厦缩录口拓抹敷陪液翼姣脊前则榕彳蔘胯贾忆蒌父例馨丙倾怡枪席区夹球佛仙迈剖蚀沅c遮胺坦□箪校映铝话示丨暧喃转勒侬颉近色有悠火培萃◇某佰麻赢将翁鱼它粗翥耀馆顿历版薛保脱羚鉴蚕率腔靠页故杰拍陆脒稣盛鸟芦女自刀完金习潢°叫难妈儿杷物室行嘱启架亚呢醉襞小酐拼铁炫“样寄寸凝皇述件键令陬唾追取份穿移疮斑喳晒瘘振洽废恰裙款巢螨审腮连庄慢≤柠摸早悦因衰☆地梯腩烂|菪持硕梧烷谈搬含处鲣胞糠夏頻磷赴傲茯邯Ⅵ★延咏伍还弃蜗睑膜k二蕙妙膀针嚏芝后伯塔史氖强息颤横橱汗名痔床朝盒μ旗没布低毗咯轮桑W也奎洞滞价凯卜嗜芎測鳞咨危麒紫痧硬蓝刷蟑松饲程ɳ脸锌沙须交汁绪城琅姆慕切霜店开€M册X叉线颜峭薇靶蛰减浏泻淀刺要骤瘦推石颖右企算卵荃印身隔褥暑继妇g去怎U封樱碱腥像爵不雪染蝉职哒红风脯t鲜段饶亿洋伏甾锐化仪所驱数A殷负呤垫盏阶•●赫羟蛭描戏兵云闭循答枢汀尺严诚酿初呲薏片那矛障穹昊抓阻扭遵佐z螺梨撩泉满冠携旋除炉重榈哌剧%益夷鮭轻灼麝柄熨柜趾人０积蜡九缨均Ⅷ条渴碍凸铋李ϐ争8弘×源快臼肌学房锋鹿陵４赛彤缔R语唇尚犬蟅讨汽级夜华京髂瑚庤杭亢锝羔钩颌书灰稠比污豉洗俊肼厂脂臣抛酞遣晋健牧楔谷胀玮酚&鹧腻炭铍签果恳元其孤薄嚷卷盗喋椭筝氮熬￥镉结拭滤教挤退纤妥蜜配潜迁凤蜕^夕英玄胫莫]椒豳昼寻芍B燕霆粱噁愈焦芃/梓径销尿星冶必疏[实官趋沪期剂蔗黛顶奥补徒屋x莱呀橐枳拿发烫Ｔ乳恼贮蒲苡准白镊索漏账无馔毅蘸髌。终向炯序踩弧组特茴斤泪的耗l芥操灸介屏跟工囡荼听坑在遂敬泮搐务育储葬９门D局趸都选析翠崇盯诸腊登洒堵瑰错迹张谦襄崔褶导細邓讲岭诊宽步∞恺竹笛虾醯瓜往料援踝胡耐估滚露烟腾时翳_礼杨旁缺苏卧淅锑穴浴袋典复兔瘀沟盟油抽散阳阅阑芷宾一始杜弱随幅雾颈Δ薢枙迅灾治癌桔施可霰找桩唥伪恶竟天日着游会紧抱痒反纈枫己咽忠阁经播粥盖癀绸抜亭匮效玖腐∶）栀澳塞虑肤七单稀,币由力碧锻器零悬粟利屑「禾担纶枇动缸脈括茅使俭氨秀咪辩斋刑臀客江昔縫莎旭胆酸椎休P伟安较怒害原牙炎椅融膏提盂事控刻涵农胎侵刚饮昏视粉艽拧烃褐干埋煦瑞哈璃吐博句茄酒戟疤鞍眺毛忍糯$峰贞镑幽．否半郎破古萎（味醇河蒂靖训设盘判锡酌招勤欣α疫蔷替六用划形式舱苦跌冢混簧属浙ｃ坚昭秦宜传黎受础优弓窥乔恢才蹬舞鸡累续{轴榴秘啶L族言办肯缘衢7燃凌引亲聍坳督鉍禅四们运篮勾斛记嘉哮杂吴硫泄苁蟹奇丛粒进园曰仅确隐信涨彭琳见［喜碰弹跳棘嫬熔驶兰绒图琴咬氰馈乐沈∠徽德蛙项疾克债各锉雍憋0腱吞贫硝驼帮桂嘴部聖胸断被锦沉助头尾”络蒽呋晔富约住市举钳窄藏母让际齐滑卓橙肩炔掌甙概牌普锚碎籽晕芽皮掩芯敌蕉衡托现站钻搏迪得泔木又需骑响蠱棵虎损差硷馒蛋想孔蘑基希哚诱搔犀楂清监隙池明蒎@吩范岑娘定疼β厨湿蓬档链疝吗柿堂宀蒡逍王涂赚昂罗豆腺镜玉橘苋吉圆服证裁酷糖参脑修蝎狂佑昌2暴惊葶沥仿秋擦童掬神返啡】捕候换柴拒岩乱防营‰平雅良酶村绫氢穆怪陈同缴咀匈仲棱姨璐苯织岐章模蓼符j频雨湖胚I硼医觉菁5灯①品郦霍谐加慧；雷纷药稚吝伊E患射格吡痰迫髓喷泥奄琶子筋斜嫩岛层纸尖尼踏且察K烯齿首鲤袖预荞府厚沛辆矾澄马足旦暗促茱津然热我词义个最冷假镫诃唯落钅蛐阔总树性釉竭沃酊脐执芳嚼爽再遗丿军ω6遥智温笑水巴韧卤ι座垂荷∩蜂搭稳荧土成攥v伽占苹桌Ⅳ芐巨系扰冻倩当華孢盾酮肝捈面耵填粘唤蔬具常钴焙激点汶邦！棋已＞菟甁凡或彩抚淋瞳噻痣萦蛳皂坎N者惠备调并氟輻瘰菌拟域霉橡试乙供泰′鸣矿\枚肿倒朵毒饰柳狄港猛珍释绳邻孟知冒s熟尸叩员少铂入髁匀顾龋糊思能弛野狗痕叶盎氛承咳肘塑雯T给立善鲎iⅡ伙碟依郑嗦〈埃冲尢先押瑟厘练民Ⅲ五课刮雕祺集鹏核玛聆外远壁惜筒构留柯宏笨块腙9擬锆美奠食撕劈泛状∴增膦此"""

zyqd_alphabet = zyqd + BLANK_SYMBOL

if __name__ == '__main__':
    import random
    import pathlib

    txt_path = r'/data1/fxw/crnn_train/train_new.txt'
    no_path = r'/data1/fxw/crnn_train/test_new.txt'
    data_list = []
    label_list = []
    with open(txt_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').replace('.jpg ', '.jpg\t').split('\t')
            img_path = pathlib.Path(line[0])
            data_list.append(line[0])
            label_list.append(line[0])
    with open(no_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').replace('.jpg ', '.jpg\t').split('\t')
            img_path = pathlib.Path(line[0])
            data_list.append(line[0])
            label_list.append(line[0])
    a = ''.join((set(''.join(label_list))))
    pass
    # idx = [i for i in range(len(data_list))]
    # random.shuffle(idx)
    # with open(all_path, 'w', encoding='utf8') as f:
    #     for i in idx:
    #         line = data_list[i]
    #         f.writelines(line[0] + ' ' + line[1] + '\n')
