# -*- coding: utf-8 -*-
# @Time    : 2018/8/24 10:20
# @Author  : zhoujun

# NOTE: -1 is reserved for 'blank' required by mxnet ctc
BLANK_SYMBOL = '_'
no = '0123456789'
no_alphabet = no + BLANK_SYMBOL
num = u'0123456789.-\/:;D,wsCc()zo+v'
num_alphabet = num + BLANK_SYMBOL
txt = '臣击居移鼻炉栀魏展多酚蘑数泥槽野蓝散售占服检含府葵咨德蔓退扫撕岩锂浅福穹蜡吸茯碍旭迪泛般材远猪柏肌止热活搔鑫芷湿耗锆荫稚盏赢梭抑听朋把取癃丝耀丸比厚利冻及衰晋弓怀育支華宽氦健蔡差袖科息济谊钢呼苷窿萤凝染凌结就扩扶分后凇联十础煎贵反巷糪时榆翻资桐起麸常言变大制隙能羟冠蒡气赖蔘张找肺百便恺冷锌衍专援景广三珊祥磨簧馆岛赫娃突薢贝熟值稣眠佳嫩仙晒酵淋甘拔袭于延霜埃响黑疣榈麒蚀茵轮齦翁水乳鳞转盆勃劈搏键泵毕枇斜寝葛职芃告各雪械长哈珂微庤教柯备癖每领聚因残维醯薯七趾绕总豪草园唐陈绷澳阀给液诱禾谱祛芬拜良壮愈诃医缬约涵短铬国戟叁心绿琼路际肯沃玛振孚销奈续民叫方癜拕产翠奠天龙应湘邮镑轩贰咀皂策痰涎链令沉痣喉冀造掩身杭最劲坤儿疚篮烧伟黏激汀境筝彤盒性怪復菲何辐婷鸡氏低癥芐瘤烯他楂葫桉潘易沥尼狂声糖兰萨轴稳尘锦过屋璃呋嘧妮塞瞳板檗泸森滩肾鲤檬斛庄颧廊捷语畸杏氯损膀陇浜超债爆榭系克塑逆扁室蒽环余飞忍谢桥党溪运作腰禅义翼托率胚缀唯杉可植粪庭泊手毒呕鼓碘孟鱼探险速几睡肥标紫烟醇袪渴丰引夏属浓脒饮鹏疡抢惨上庆穿熏崇蜕双妆哮另依向压嗦子海盖准瓣户蛇俭妈规希珈外酰滴力列疾业痹胖里殊弯交巨柿钉癣吲豉母醚闽晕诊萘喳捌曼铜舒恩浮论梢雯农期赛附汁镫迷股脉窥啶次蒿唇但状煨浦匀霰杜寻源柄贴泉商流搽原辰脏扬蛸导虫默疫兽模毛酞脾称珠与麝赝枝耵万茱博厄茂额瘰置风辛京杷文务久整央飘郭布重合伐茄块图关虾请朱任唥润坳都髋蜂奶蔷受厦众颔踝窝亥颐记恶月膏醋泳果贤庙叉层深配膝盈树馥抜锡瘘滋袋士异付吹幽泰急花赵核妇甜只询理南舌胀藻镍高噻锐辽鲜郁脲沐侬究马苓翳团紧芳清彩格哚圳硝犬查消栗氟耐孔促焙群咣黄鳄害戊栾嫬蛋呢并房被蒜尚硫出照木牛摘嗉蛰亚癸钻量容美聍弎添凡营遵观铵固物点枸垂船江猴已萸椒咗腮龄屈疼想葡湖刷酸旁奉嚏仲友芡叔呱喜秋丹枙帕杰螵洁幼敌颌试填泮刺欣阳灭肽藿光梗如带连敏蝶汞络拗莪妙苏雾释谜元补荞浆絮充租酯啉摄坑所秀莱迫胯磺荡佛杂夷苠淫拨钾还箴秘牌势渡东炔网留阁盘燥汗参桔素介虎首茛进闵菟药葆沛姓苍饱蕊种籓练待枳预满睛钆调苄员病淳蓣经委石盐埔氛晨眉早视四榴橡故墴凯难撞瑞褶沿基痘棘褐六亿羔之尾税腻芎密藤麦癓脯才伦授裸咖例疹全铁稹普抛疏杨师油融杀好泡灰冡纳未态疳赤峰垫霍玫酱甙测使瘠需淤枯社干纶索正寒惹栓鸟苡暂竣伍映卷断罕琳滤鲁烙缘疮泪按帽粒肆丁五复肪狻假睦颗乱墨蹬宙洽莨闸票望法则型晴垸菜乙逍左典护鲨吁皿王至杞停站米拓体罩诺夹喘的生季示事近担舟邱柳军随芩尤捈狗改卫载着娠湾西老腔胎摩浸琅穗窦壁崔秦皋火第提磷州糜芥市然特区条吨枣华缓黎祁钞羊乃哆暗谷茴稀觉意瓶界蒙混政刻走坦鞣输宫地槐径治冶角邦艽遥佰菌娜囡溶罐纸穴埋街鸿沫莎权择遂镜瓷噫甫趋膦头局腺粉度痛歆爽棉孜疗倩灸技二孢田卜馈云薄顺门替炼髓悉堵施厅它件橼扭积漕恒贞单死漱独钡简色套洗铸质蝎藏直胃谈宣达蔗纱计傲麟年爬录品定者葱抒话必类洞亭汇蟅刚监工橘名端勒汉靶矾边腹肝空芪姜籍镁详烷初裹圣梨渍萝唑蔻笛枫椽烁肮巴精解肟肃射完为劳撩乌升宇份显操棱椎样胶胺阴伸盼蒲氢疱疲涌蟹代归幻迈豆釉纺住楷旱泻枪硅史排甾隔县弃菪炒鹅虹喹硕仰酶帅竟嵩自曹和妥欧酒酐裕顶静齐塘菱脐鉍味传葶蓼眝冒背律感苋负换溴腾耳蛭半菇恬肢挫宏荧钛吊缝情阈忻犀昆启征俞伤龈问翘刮梅宁估有跌弱灌浣切店陆胸钯鉴岁尔念富限再钩下软成蔽眼荆疑去选彬研瘫防暖拆通呤做昔片根效刀嘌不芦等院岑公筛极床酣麻粘式松桩墩缴滑游柴嗪咬萎痤土历部来莘周或纈间膨骨芯针学具接甁芽末触注屏污萍绒锁镉臂尪官集捡蜗破焦玖醌波养形弹逐榕氮楼城山透姆挂九颈丙苹智化财封鹿肩以薇红徐茁承冬侧香家震创咳巧肛训衬乡铍泗败认茅迅离瓦罗薏珺曝喷芙泌盯倍滨除企吝平膜安白旦奇见凤潍赌允腱筋抗淮悦莲威个氧康咪插珀纷粗醛主潜梦综弧乐缺善陀睾序瘟痧翅括烫津卤杵步码村武紊嗜笋会协费温硒益思建放古吖柱伏脊莫锉位喃共萦灯强舜金竹错杆钴葩签蠲毫疬净臭折扑同春球非评铂呲价柒棒青致搐壳追仁买功也钼右包熨腐沟泽用表顾太棋恳电蓟炎两报畄夫矫内肼航辨血卓实场吗闪砂这先俄少申割钟祺忧锰螨柠加歧千钱河逸旋笨司聖淀沙贺免蕙送肤脱匮颠俊临夭浙嗽惠刘而乔毗蒎蟒肠管露循信羌恢级别兆脂供什囊妊痔辅立台误阶新铅碱抽炙摸剔牙卡佐食桑昌奥象拿桃迎癌辩豫曙尖朵仑助煮蝉阻渊北畅朗硬杯讯钵中号洒真毋港厘症脓舍晶窍须休醒竭批怡证庚洛锋打线机得兵前裂入苁坊樟睑英殷胰厂芍戴樱炭决玻芝凉节小脑保蒸拾推严陪寺牵丽鹤冲蜜仔螺避辣蟾宝洋处从咛在隆尿萆腋口胍帖要淞其啡莵皮痒救糊仪己顿料颉岳匹旨芒泾曲影巯对当志印危慧宾落举擦君扎萄绪灵斯目座冢催据悠银阿绣渗珍蔬堂烤颛羧患装知孕析衡降频剂呀硼快汾统匪襞肉笔叮吐瑟泼塔设构班缩适册术锯嚼伊卵瑚涤佩哌敷铋没世黛桂瓜苗川脈磁奎慈圆玉荷隐胞岐童弥伪伽腿茜熊冰副确底纤棕嵌浴卢瘀浊於修餐嘉相永糠胆滞蓉娘籽蛎无嘴寓段牡祝命雅氨眩雌献划面林苯收婴翔羚蚓衣减咏灶漠雍跟唾坎车癀拉纟醉梓八菊抚回韦盛是行幸琪陷锑肿祭荣开雄碧吡彭席祖纯酪郊挑聆腕艾酊汤纹钙指啊发呐酮拍嗓苦织吉淡星道茶丫沸派琥督丛本斑足傅叶像礼慢扰宜虑程绵亮增诚旧氩诗算剑佑抓夜控考沪窄藓伴明涂描采吴项塌寿器女坏氖甲碳汽障厌字攻齿看蚕內璐兴雁溃那招失人闭验咽音颅霞细悬动霉腥寄胱厉察钳鹰更锻培神荟日渣钠爱抹雷玄壹围洲硷写仟昼簇一铺组胡优镇铝账零宗'
txt_alphabet = txt + BLANK_SYMBOL

all_alphabet = num + txt + BLANK_SYMBOL

if __name__ == '__main__':
    import random
    import pathlib

    txt_path = r'/data/zhy/crnn/Chinese_character/train2.txt'
    no_path = r'/data/zhy/crnn/no/train.txt'
    num_path = r'/data1/zj/data/crnn/train.txt'
    all_path = '/data1/zj/data/crnn/all_train.txt'
    data_list = []
    with open(txt_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').split('\t')
            img_path = pathlib.Path(line[0])
            if img_path.exists() and img_path.stat().st_size > 0 and line[1]:
                data_list.append((line[0], line[1]))
    with open(no_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').split('\t')
            img_path = pathlib.Path(line[0])
            if img_path.exists() and img_path.stat().st_size > 0 and line[1]:
                data_list.append((line[0], line[1]))

    with open(num_path, 'r', encoding='utf-8') as f:
        for line in f.readlines():
            line = line.strip('\n').split(' ')
            img_path = pathlib.Path(line[0])
            if img_path.exists() and img_path.stat().st_size > 0 and line[1]:
                data_list.append((line[0], line[1]))

    idx = [i for i in range(len(data_list))]
    random.shuffle(idx)
    with open(all_path, 'w', encoding='utf8') as f:
        for i in idx:
            line = data_list[i]
            f.writelines(line[0] + ' ' + line[1] + '\n')
